<template>
	<div class="main">
		<van-nav-bar title="服务条款" @click-left="goBack" fixed left-arrow fixed />
		<section class="page-main" ref="wrapper">
			<div class="box">
				<p>中城物联（深圳）有限公司在此特别提醒用户：</p>
				<p>请您务必仔细阅读本用户服务协议中的各个条款，本协议为您使用平台服务时所应遵守的各项规定，在本协议中明确了您可以和不可以利用平台服务所进行的各项行动，作为企业用户，您应同意本协议中的各个条款，方可享受服务，并应督促您企业所属员工在接受中城物联提供的服务时遵守本服务协议之规定。【中城物联——电气火灾监控系统】系中城物联（深圳）有限公司开发、研制的为用户提供【智慧用电安全系统】服务的网络技术服务平台。</p>
				<p>一、中城物联的应用程序、源代码、LOGO、界面设计、应用程序编程接口（API）所关联的所有知识产权均归深圳市中城物联（深圳）有限公司。</p>
				<p>二、用户在【中城物联——电气火灾监控系统】创建的数据归属用户企业所有，在服务期内企业用户有权进行任何形式的处置，包括从平台中复制、导出和删除。中城物联授予用户使用的企业用户所拥有的互联网域名作为用户权证的唯一识别信息。</p>
				<p>三、用户不得进行任何侵犯本网络服务平台或其要素作品的知识产权的行为，或者进行其他的有损于中城物联或其他用户合法权益的行为。如用户存在此种行为，中城物联采取技术措施防止用户从事下述行为，包括但不限于：</p>
				<p>1、删除或修改本网络服务平台上的版权信息，或者伪造ICP/IP地址或者数据包的名称；</p>
				<p>2、进行编译、反编译、反向工程或者以其他方式破解本网络服务平台的行为；</p>
				<p>3、进行任何破坏本网络服务平台使用公平性或者其他影响其正常使用秩序的行为，如利用BUG（又叫“漏洞”或者“缺陷”）来获得不正当的非法利益；</p>
				<p>4、利用技术非法侵入、破坏本网络服务平台之服务器系统，或者修改、增加、删除、窃取、截留、替换本网络服务平台之客户端和服务器系统中的数据，或者非法挤占本网络服务平台之服务器空间，或者实施其他的使之超负荷运行的行为；</p>
				<p>5、利用本网络服务平台故意传播恶意程序或计算机病毒，或者利用本网络服务传播侵犯第三方知识产权、肖像权、姓名权、名誉权、隐私或其他合法权益的文字、图片、照片、程序、视频或动画等资料；</p>
				<p>6、通过中城物联进行垃圾信息发送（本协议所指垃圾短信定义为用户使用本平台功能对陌生客户及不同意接收信息的客户、人员进行短信发送等行为）。</p>
				<p>四、中城物联负有保护与用户有关的资料、数据、作品或其他资料的义务，但因其他原因而披露给第三方的除外。中城物联保留使用汇总统计性信息的权利，并且完全通过匿名统计方式，并且不是针对特定用户分析。</p>
				<p>五、中城物联有权对本合约的条款进行修订并在修订生效日前一个工作日将更新公开公布在中城物联网站【www.szcciot.com】。</p>
				<p>本《协议》各条款是可分的，所约定的任何条款如果部分或者全部无效，不影响该条款其他部分及本协议其他条款的法律效力。</p>
				<p>本《协议》各条款的标题只是为了方便用户阅读而起到提示、醒目的作用，对本《协议》的解释及适用没有任何指引作用。</p>
				<p>中城物联基于本协议及其补充协议的有效的弃权必须是书面的，并且该弃权不能产生连带的相同或者类似的弃权 。用户与中城物联因本协议或者补充协议所涉及的有关事宜发生争议或者纠纷，双方可以友好协商解决；协商不成的，任何一方均可以将其提交原告方所在地有管辖权的人民法院诉讼解决。</p>
				<p>本协议及其补充协议签订地为深圳市，均受中华人民共和国法律、法规管辖。用户给客户发送垃圾短信，经运营商或其他监督部门查实的，德派森科技将视情况给予违规用户年服务费1倍至5倍标准的违约罚款。</p>
				<p>《【中城物联——电气火灾监控系统】平台用户服务协议》所述内容已经全部浏览及阅读，本公司承诺按照中城物联（深圳）有限公司公开发布的《【中城物联——电气火灾监控系统】平台用户服务协议》规定的内容使用【中城物联——电气火灾监控系统】平台提供的服务。</p>

			</div>
		</section>
	</div>
</template>

<script>
import { Dialog } from "vant";
import BScroll from "better-scroll";
import axios from "axios";

export default {
    name: "myBook",
    data() {
        return {
            // query: this.$route.query,
        };
    },
    async mounted() {
		this.setupBetterScroll();
	},

    methods: {
        goBack() {
            this.$router.back();
        },

        logout() {
            this.$store.commit("accountLogout");
            this.$router.push({ name: "loginPage" });
        },
        async setupBetterScroll() {
            if (!this.scroll) {
                this.scroll = new BScroll(this.$refs.wrapper, {
                    tap: true,
                    click: true
                });
            } else {
                this.scroll.refresh();
            }
        }
    }
};
</script>

<style lang="scss" scoped>
$dcyColor: #282549;
.box {
	padding: 15px;
	background: #fff;
    p {
        line-height: 1.8;
        font-size: 15px;
        color: #666;
		margin: 10px 0;
		text-align: justify;
    }
}
</style>
